def concat(s1: str, s2: str) -> str:
    """
    Используя метод «голова — хвост», создайте рекурсивную функцию concat(),
    которая получает массив строк и возвращает результат их объединения в одну
    строку. Например, функция concat(['Hello', 'World']) должна возвратить
    строку HelloWorld.

    Args:
        s1: Первая строка.
        s2: Вторая строка.

    Returns:
        str: Конкатенированная строка.
    """
    if len(s1) == 0 and len(s2) == 0:
        return ""
    if s1:
        return s1[0] + concat(s1[1:], s2)
    else:
        return s2[0] + concat(s1, s2[1:])


def product(arr: list[int]) -> int:
    """Используя метод «голова — хвост», создайте рекурсивную функцию product(),
    которая получает массив целых чисел и возвращает результат их перемно-
    жения. Этот код будет практически идентичен коду функции sum(), пред-
    ставленной в пройденной главе. Однако обратите внимание, что в базовом
    случае с массивом, содержащим одно целое число, возвратится целое число,
    а в базовом случае с пустым массивом — 1.

    Args:
        arr (list[int]): _description_

    Returns:
        int: _description_
    """
    if len(arr) == 0:
        return 1
    return arr[0] * product(arr[1:])
